[
  {
    "crawled_date": "2017-06-27T09:49:18.887130", 
    "progweb_title": "NationBuilder API", 
    "progweb_url": "https://www.programmableweb.com/api/nationbuilder", 
    "progweb_descr": "NationBuilder is an open platform for users to create online communities centered around issues relevant to them. Users can create community organization websites, access a people database, and use communication tools such as email, text messaging and social media.The NationBuilder API helps developers to create community organizing-driven applications by integrating various service endpoints within third-party applications. These endpoints can be information on people, campaign data, donation data, calendar information, event data, and other calls. The API uses REST calls and returns JSON.", 
    "api_url_full": "http://nationbuilder.com/api_documentation", 
    "progweb_date": "10.15.2013", 
    "correct_link": 0,
    "api_name": "NationBuilder", 
    "error": 0, 
    "progweb_cat": "Social,Community", 
    "id": 252, 
    "api_url": "nationbuilder.com"
  }, 
  {
    "crawled_date": "2017-06-27T10:06:53.181219", 
    "progweb_title": "Wolfram Alpha API", 
    "progweb_url": "https://www.programmableweb.com/api/wolfram-alpha", 
    "progweb_descr": "Wolfram|Alpha is a \"computational knowledge engine\" whose long-term goal is \"to make all systematic knowledge immediately computable and accessible to everyone. We aim to collect and curate all objective data; implement every known model, method, and algorithm; and make it possible to compute whatever can be computed about anything.\" It contains 10+ trillion of pieces of data, 50,000+ types of algorithms and models, and linguistic capabilities for 1000+ domains.  The API provides two general classes of queries. At the highest level, you can submit free-form queries like users might enter at the Wolfram|Alpha site itself, and get back full Wolfram|Alpha output in a variety of formats. The second type of query is a lower-level request for a single well-defined result, or range of results, from their entity/property-based data API, such as a caloric value for a food item, or a tide table for a requested location", 
    "api_url_full": "http://products.wolframalpha.com/developers/", 
    "progweb_date": "05.16.2009", 
    "correct_link": 0,
    "api_name": "Wolfram Alpha", 
    "error": 0, 
    "progweb_cat": "Reference,Search", 
    "id": 431, 
    "api_url": "wolframalpha.com"
  }, 
  {
    "crawled_date": "2017-06-27T10:24:08.767946", 
    "progweb_title": "GETHealth API", 
    "progweb_url": "https://www.programmableweb.com/api/gethealth", 
    "progweb_descr": "GetHealth is a Unified RESTful API to access health data from wearables and devices. It allows users to integrate the sources like Dailymile, Fatsecret, Fitbit, Google Fit, Jawbone, Lifefitness, MapMyFitness, MapMyRun, MapMyWalk, Microsoft Health, Misfit, Moves, PredicctBGL, Runkeeper, Strava, Sony Lifelog, Withings, and 23andMe. It also allows integration to medical devices. There are api calls available for activity, diabetes, weight, nutrition, sleep, and genotype. Furthermore it eases the user authentication process for each source with single-sign on API call. Also it normalizes the data across multiple sources and provides unified data structure.", 
    "api_url_full": "http://platform.gethealth.io/#!/Account_API/CreateUser", 
    "progweb_date": "05.13.2016", 
    "correct_link": 0,
    "api_name": "GETHealth", 
    "error": 0, 
    "progweb_cat": "Healthcare,Applications", 
    "id": 698, 
    "api_url": "gethealth.io"
  }, 
  {
    "crawled_date": "2017-06-27T10:41:31.854793", 
    "progweb_title": "SecureNet API", 
    "progweb_url": "https://www.programmableweb.com/api/securenet", 
    "progweb_descr": "The service provides a secure payment platform for integration with applications needing checkout functions for credit card and ACH (automated clearing house) transactions. Existing shopping cart packages already integrate with the service, creating a range of solutions for applications.  API methods support submission of customer identity and payment information, either credit card number, expiration, etc., or bank account information for ACH transactions. Transaction submissions can also specify product specific information for the hotel, auto rental, and other industries.", 
    "api_url_full": "http://www.securenet.com/developers", 
    "progweb_date": "02.19.2012", 
    "correct_link": 0,
    "api_name": "SecureNet", 
    "error": 0, 
    "progweb_cat": "Payments,eCommerce", 
    "id": 931, 
    "api_url": "securenet.com"
  }, 
  {
    "crawled_date": "2017-06-27T10:41:14.734069", 
    "progweb_title": "Whipplehill API", 
    "progweb_url": "https://www.programmableweb.com/api/whipplehill", 
    "progweb_descr": "The service provides functions for managing school records via a software as a service (SaaS) platform. Its Podium module supports faculty needs for instructional resources, class roster management, grading, and related tasks. Student-focused functions include course information access, faculty and staff directory, attendance records, etc. Web access is provided via specialized web content management system (CMS) capabilities.   API methods support interaction by partners within the provider's \"Ecosystem\" to deliver specific functions and services. Methods handle user profile settings and access permissions, athletic and other school event information, posting and dissemination of news updates, etc.", 
    "api_url_full": "https://webservice.whipplehill.com/api/whipplehillservice.asmx", 
    "progweb_date": "12.26.2012", 
    "correct_link": 0,
    "api_name": "Whipplehill", 
    "error": 0, 
    "progweb_cat": "Education,Management", 
    "id": 1048, 
    "api_url": "whipplehill.com"
  }, 
  {
    "crawled_date": "2017-06-27T10:58:53.805062", 
    "progweb_title": "Trendrr API", 
    "progweb_url": "https://www.programmableweb.com/api/trendrr", 
    "progweb_descr": "From their site: Track, compare and share data. Identify trends across social graphs and networks, realize the potential of p2p, track engagement metrics, look at what is really happening, real time.", 
    "api_url_full": "https://www.trendrr.tv/login", 
    "progweb_date": "04.12.2008", 
    "correct_link": 0,
    "api_name": "Trendrr", 
    "error": 0, 
    "progweb_cat": "News Services,Social", 
    "id": 1146, 
    "api_url": "trendrr.tv"
  }, 
  {
    "crawled_date": "2017-06-27T10:58:42.133060", 
    "progweb_title": "FanSnap API", 
    "progweb_url": "https://www.programmableweb.com/api/fansnap", 
    "progweb_descr": "FanSnap is a live event ticket search engine for fans. Its mission is to provide the most comprehensive, accurate, fast and easy-to-use resource for fans to find the tickets they desire to sports, concerts, and theater events. FanSnap allows users of its website to search for tickets from all over the web in one place, choose seats, select the tickets and then purchase directly from the ticketing site. Add a similar service to your site. Monetization opportunities available through the FanSnap Affiliate Program.", 
    "api_url_full": "http://seatgeek.com/build", 
    "progweb_date": "07.19.2009", 
    "correct_link": 0,
    "api_name": "FanSnap", 
    "error": 0, 
    "progweb_cat": "Events,Sports", 
    "id": 1219, 
    "api_url": "seatgeek.com"
  }, 
  {
    "crawled_date": "2017-06-27T11:15:21.030983", 
    "progweb_title": "Canadian Parliamentary Data API", 
    "progweb_url": "https://www.programmableweb.com/api/canadian-parliamentary-data", 
    "progweb_descr": "Canadian Parliamentary Data is an attempt to collate data from various federal sources into a single relational database.  It is a relational database and accompanying API of Canadian parliamentary data that includes; The House of Commons, The Library of Parliament, Elections Canada and more.", 
    "api_url_full": "https://api.iscanadafair.ca/", 
    "progweb_date": "06.01.2017", 
    "correct_link": 0,
    "api_name": "Canadian Parliamentary Data", 
    "error": 0, 
    "progweb_cat": "Canadian,Data", 
    "id": 1539, 
    "api_url": "iscanadafair.ca"
  }, 
  {
    "crawled_date": "2017-06-27T11:32:17.154836", 
    "progweb_title": "Eristica Game API", 
    "progweb_url": "https://www.programmableweb.com/api/eristica-game", 
    "progweb_descr": "The Eristica Game API supports the integration of interactive and engagement functionalities in game applications. The API allows developers to provide players with greater flexibility for sharing games through social networks, participating in challenges, and setting betting preferences. Developers seeking to access the API are required to email Eristica for further instructions.", 
    "api_url_full": "http://eristica.com/en/gameapi", 
    "progweb_date": "03.18.2017", 
    "correct_link": 0,
    "api_name": "Eristica Game", 
    "error": 0, 
    "progweb_cat": "Games,Data", 
    "id": 1836, 
    "api_url": "eristica.com"
  }, 
  {
    "crawled_date": "2017-06-27T11:49:27.940199", 
    "progweb_title": "Zoho Sales IQ API", 
    "progweb_url": "https://www.programmableweb.com/api/zoho-sales-iq", 
    "progweb_descr": "The Zoho Sales IQ API facilitates the customization of chat widgets for web applications. This allows developers to prescribe chat widget functionalities that that are suited to users’ scope of existing web activities and preferences.", 
    "api_url_full": "https://www.zoho.com/salesiq/help/jsapi.html", 
    "progweb_date": "02.11.2017", 
    "correct_link": 1,
    "api_name": "Zoho Sales IQ", 
    "error": 0, 
    "progweb_cat": "Sales,Chat", 
    "id": 2165, 
    "api_url": "zoho.com"
  }, 
  {
    "crawled_date": "2017-06-27T12:07:00.274942", 
    "progweb_title": "SmartyStreets US Autocomplete API", 
    "progweb_url": "https://www.programmableweb.com/api/smartystreets-us-autocomplete", 
    "progweb_descr": "The SmartyStreets US Autocomplete API features the predictive functionality for searching addresses and locations. The API is equipped with a keyword detection mechanism for generating various suggestions for locations or addresses. The API conveys requests in HTTP or URI Query String/CRUD format, and returns responses in JSON format.", 
    "api_url_full": "https://smartystreets.com/docs/cloud/us-autocomplete-api",
    "progweb_date": "12.04.2016", 
    "correct_link": 1,
    "api_name": "SmartyStreets US Autocomplete", 
    "error": 0, 
    "progweb_cat": "Predictions,Addresses", 
    "id": 2285, 
    "api_url": "smartystreets.com"
  }, 
  {
    "crawled_date": "2017-06-27T12:06:43.478310", 
    "progweb_title": "Hearthstone Card API", 
    "progweb_url": "https://www.programmableweb.com/api/hearthstone-card", 
    "progweb_descr": "The Hearthstone Card API supports the querying of the Hearthstone Cards using specified parameters.Its integration makes it easier for users to apply specific parameters, such as minimum and maximum range when querying specific cards. The API sends requests and responses in JSON format.", 
    "api_url_full": "https://cardapi.portal.azure-api.net/", 
    "progweb_date": "01.22.2017", 
    "correct_link": 0,
    "api_name": "Hearthstone Card", 
    "error": 0, 
    "progweb_cat": "Games,Entertainment", 
    "id": 2392, 
    "api_url": "azure-api.net"
  }, 
  {
    "crawled_date": "2017-06-27T12:24:24.722264", 
    "progweb_title": "FantasyData NFL Scores API", 
    "progweb_url": "https://www.programmableweb.com/api/fantasydata-nfl-scores", 
    "progweb_descr": "FantasyData.com provides developers, the fantasy community, and media clients around the world with real-time content and statistical data of different sports disciplines. Its product portfolio features a variety of fantasy sports, web applications, and a host of RESTful APIs that include the NFL Scores API. \r \t\r The FantasyData NFL Scores API provides weekly and seasonal NFL data of scores, teams, game stats, news by player, news by team, team table standings, and stadiums. Developers can deploy the API in website automation or application integration. The API returns responses in either JSON or XML format.", 
    "api_url_full": "https://developer.fantasydata.com/docs/services/57a0190935491a1858749954/operations/57a0190a35491a0ef079a13e", 
    "progweb_date": "11.27.2016", 
    "correct_link": 1,
    "api_name": "FantasyData NFL Scores", 
    "error": 0, 
    "progweb_cat": "Sports,Fantasy Sports", 
    "id": 2486, 
    "api_url": "fantasydata.com"
  }, 
  {
    "crawled_date": "2017-06-27T12:24:24.695947", 
    "progweb_title": "ARSnova API", 
    "progweb_url": "https://www.programmableweb.com/api/arsnova", 
    "progweb_descr": "The ARSnova API integrates learning management systems in an open source environment. HTTPS callbacks can be performed with SSL web socket encryption. JSON formats are available under OAuth2 authentication. ARSnova is powered by Technische Hochschule Mittelhessen, University of Applied Sciences, aiming to be an innovative approach to Audience Response Systems (ARS). Additional API information at https://github.com/thm-projects/arsnova-backend/blob/master/README.md", 
    "api_url_full": "https://arsnova.thm.de/blog/en/open-source-development/", 
    "progweb_date": "11.19.2016", 
    "correct_link": 0,
    "api_name": "ARSnova", 
    "error": 0, 
    "progweb_cat": "Education,Learning Management Systems", 
    "id": 2496, 
    "api_url": "thm.de"
  }, 
  {
    "crawled_date": "2017-06-27T12:23:54.503640", 
    "progweb_title": "SignWise Services API", 
    "progweb_url": "https://www.programmableweb.com/api/signwise-services", 
    "progweb_descr": "SignWise Services provides the necessary infrastructure for applications allowing users to authenticate and sign documents using electronic identities issued by certificate authorities in the network. SignWise Services is fully eIDAS compliant and provides APIs for easy integration of new applications.", 
    "api_url_full": "https://signwiseservices.com/rest_api_overview/", 
    "progweb_date": "12.26.2016", 
    "correct_link": 1,
    "api_name": "SignWise Services", 
    "error": 0, 
    "progweb_cat": "Electronic Signature,Authentication", 
    "id": 2676, 
    "api_url": "signwiseservices.com"
  }, 
  {
    "crawled_date": "2017-06-27T12:23:54.481928", 
    "progweb_title": "Polysync Shared Memory API", 
    "progweb_url": "https://www.programmableweb.com/api/polysync-shared-memory", 
    "progweb_descr": "The Polysync Shared Memory REST API allows developers to access and integrate the functionality of Polysync with other applications and to create new applications. The main API method is providing an interface for reading and writing data from a shared memory queue. Polysync provides a platform and features that allow for creating, testing, and deploying applications for driverless vehicles.", 
    "api_url_full": "http://docs.polysync.io/", 
    "progweb_date": "12.30.2016", 
    "correct_link": 0,
    "api_name": "Polysync Shared Memory", 
    "error": 0, 
    "progweb_cat": "Transportation,Auto", 
    "id": 2684, 
    "api_url": "polysync.io"
  }, 
  {
    "crawled_date": "2017-06-27T12:40:46.746058", 
    "progweb_title": "Salesforce.com Marketing Cloud API", 
    "progweb_url": "https://www.programmableweb.com/api/salesforcecom-marketing-cloud", 
    "progweb_descr": "Developers using the Salesforce.com Marketing Cloud API can deploy either its SOAP or REST interface. The SOAP interface is useful for accessing the API’s email functionalities such as tracking, subscriptions, sends, and content. When deploying the SOAP interface, code libraries are used to convert relevant programming languages into SOAP envelopes in turn facilitate data transmission between a user and the Marketing Cloud API. The API’s REST interface is useful for accessing its overall marketing cloud functionalities that include: contacts, content, journey builder, campaigns, and mobile push. The REST interface conveys requests and responses in JSON format. Both the REST and SOAP interfaces of the Marketing Cloud API share the OAuth 2.0 authentication mechanism.", 
    "api_url_full": "https://developer.salesforce.com/docs/atlas.en-us.mc-apis.meta/mc-apis/index-api.htm", 
    "progweb_date": "11.25.2016", 
    "correct_link": 1,
    "api_name": "Salesforce.com Marketing Cloud", 
    "error": 0, 
    "progweb_cat": "Enterprise,Campaigns", 
    "id": 2979, 
    "api_url": "salesforce.com"
  }, 
  {
    "crawled_date": "2017-06-27T12:58:04.973785", 
    "progweb_title": "Clearbit Enrichment  API", 
    "progweb_url": "https://www.programmableweb.com/api/clearbit-enrichment", 
    "progweb_descr": "The Clearbit Enrichment API integrates person lookup features that include name, location, and social handles. It is available in REST architecture with JSON format and SSL standard.", 
    "api_url_full": "https://clearbit.com/docs#enrichment-api", 
    "progweb_date": "10.05.2016", 
    "correct_link": 1,
    "api_name": "Clearbit Enrichment", 
    "error": 0, 
    "progweb_cat": "Business,Addresses", 
    "id": 3185, 
    "api_url": "clearbit.com"
  }, 
  {
    "crawled_date": "2017-06-27T13:15:24.154423", 
    "progweb_title": "University Domains and Names Data List  API", 
    "progweb_url": "https://www.programmableweb.com/api/university-domains-and-names-data-list", 
    "progweb_descr": "The University Domains and Names Data List API  by Hipo Labs retrieves JSON files with domains, names, and countries of national and international universities. Created by @hipolabs, developers of web and mobile.", 
    "api_url_full": "https://github.com/Hipo/university-domains-list/", 
    "progweb_date": "08.24.2016", 
    "correct_link": 0,
    "api_name": "University Domains and Names Data List", 
    "error": 0, 
    "progweb_cat": "Lists,Countries", 
    "id": 3526, 
    "api_url": "github.com"
  }, 
  {
    "crawled_date": "2017-06-27T13:51:22.030138", 
    "progweb_title": "UAE Car Registration API", 
    "progweb_url": "https://www.programmableweb.com/api/uae-car-registration", 
    "progweb_descr": "UAE Car Registration API aids the real-time retrieval of registration details along with technical data and functionality characteristics of vehicles bearing UAE number plates. Instead of prodding automobile sellers for vehicle descriptions, users can use the SOAP-based API to access crucial government-sourced automobile information including: model type, year of manufacture, year of registration, engine size, vehicle identification number, gross weight, displacement, and 50 other descriptive data fields. The API deploys both XML and JSON formats in the conveyance of requests and responses. Its coverage extends across all the seven emirates of the UAE comprising: Abu Dhabi, Ajman, Dubai, Fujairah, Ras Al Khaimah, Sharjah, and Umm Al Quwain.", 
    "api_url_full": "http://ae.carregistrationapi.com/", 
    "progweb_date": "05.16.2016", 
    "correct_link": 0,
    "api_name": "UAE Car Registration", 
    "error": 0, 
    "progweb_cat": "Auto,Registration", 
    "id": 3946, 
    "api_url": "carregistrationapi.com"
  }, 
  {
    "crawled_date": "2017-06-27T13:51:02.805069", 
    "progweb_title": "Vitortec Consult CEP API", 
    "progweb_url": "https://www.programmableweb.com/api/vitortec-consult-cep", 
    "progweb_descr": "The CEP Correios API is used to obtain information about postal codes in Brazil. This API returns information in JSON format. Vitortec is a software development firm based in Brazil which provides applications for Android, Facebook, Chrome, Windows, and Linux. Also, it provides web development services with CMS WordPress, and Bootstrap.", 
    "api_url_full": "http://developers.vitortec.com/api/correios/zip/", 
    "progweb_date": "05.21.2016", 
    "correct_link": 0,
    "api_name": "Vitortec Consult CEP", 
    "error": 0, 
    "progweb_cat": "Addresses,Brazilian", 
    "id": 4056, 
    "api_url": "vitortec.com"
  }, 
  {
    "crawled_date": "2017-06-27T14:25:35.564122", 
    "progweb_title": "Deepviz API", 
    "progweb_url": "https://www.programmableweb.com/api/deepviz", 
    "progweb_descr": "The Deepviz API allows developers to interact with the Deepviz sandbox to submit malware samples and retrieve analysis reports on them. Deepviz is designed to help users analyze, correlate, and understand key information about malware. This may include whether the malware is well-known or unique to a given environment, the communication infrastructure used by the malware, and the behaviors of a specific object.", 
    "api_url_full": "https://api.deepviz.com/", 
    "progweb_date": "01.18.2016", 
    "correct_link": 1,
    "api_name": "Deepviz", 
    "error": 0, 
    "progweb_cat": "Security", 
    "id": 4552, 
    "api_url": "deepviz.com"
  }, 
  {
    "api_url": "elasticode.com", 
    "progweb_title": "Elasticode API", 
    "progweb_url": "https://www.programmableweb.com/api/elasticode", 
    "progweb_descr": "The Elasticode API helps users integrate Elasticode's capabilities directly. Elasticode is a service to help create more personalized mobile user onboarding experiences. To create an API key, follow the regular path to create an app, and choose the API option. More information about the Elasticode API is available upon contacting Elasticode directly.", 
    "api_url_full": "http://docs.elasticode.com/docs/why-use-our-api",
    "progweb_date": "01.29.2016", 
    "correct_link": 0,
    "api_name": "Elasticode", 
    "error": 0, 
    "progweb_cat": "Application Development,Analytics", 
    "id": 4569, 
    "crawled_date": "2017-06-27T14:25:35.519815"
  }, 
  {
    "crawled_date": "2017-06-27T14:43:16.191156", 
    "progweb_title": "Streamable API", 
    "progweb_url": "https://www.programmableweb.com/api/streamable", 
    "progweb_descr": "The Streamable API allows developers to implement streaming features into an application. What the documentation shows is related to video schema, upload a video, and import a video from an URL. The API is in JSON format accessible with OAuth2 authorization. Resources to interact with users are also available.", 
    "api_url_full": "https://streamable.com/documentation", 
    "progweb_date": "09.25.2015", 
    "correct_link": 1,
    "api_name": "Streamable", 
    "error": 0, 
    "progweb_cat": "Video,File Sharing", 
    "id": 4669, 
    "api_url": "streamable.com"
  }, 
  {
    "crawled_date": "2017-06-27T15:00:38.858628", 
    "progweb_title": "StatsFC Dugout API", 
    "progweb_url": "https://www.programmableweb.com/api/statsfc-dugout", 
    "progweb_descr": "The Stats FC Dugout REST API allows developers to access and integrate the functionality of Stats FC Dugout with other applications. Some example API methods include retrieving football/soccer match results, retrieving league standings, and retrieving top scorers. Stats FC Dugout is a service that provides data for football/soccer across European, English, Spanish, German, Italian, and French league and cup competitions.", 
    "api_url_full": "https://dugout.statsfc.com",
    "progweb_date": "07.16.2015", 
    "correct_link": 0,
    "api_name": "StatsFC Dugout", 
    "error": 0, 
    "progweb_cat": "Sports,European", 
    "id": 4966, 
    "api_url": "statsfc.com"
  }, 
  {
    "crawled_date": "2017-06-27T15:34:54.955670", 
    "progweb_title": "Babelfly API", 
    "progweb_url": "https://www.programmableweb.com/api/babelfly", 
    "progweb_descr": "The Babelfly API in both HTTP and Java provide developers access to the functionality of Babelfly for integration with other websites and applications. The main API method is disambiguating text by uploading text and retrieving the disambiguation result. Babelfly is a multi-lingual text disambiguation service that provides sentiment and disambiguation of text.", 
    "api_url_full": "http://babelfy.org/guide", 
    "progweb_date": "04.23.2015", 
    "correct_link": 1,
    "api_name": "Babelfly", 
    "error": 0, 
    "progweb_cat": "Sentiment,Language", 
    "id": 5559, 
    "api_url": "babelfy.org"
  }, 
  {
    "crawled_date": "2017-06-27T16:10:32.386948", 
    "progweb_title": "FACTURAgem API", 
    "progweb_url": "https://www.programmableweb.com/api/facturagem", 
    "progweb_descr": "FACTURAgem is an online invoicing software, provided by ASP Gems. The FACTURAgem API lets developers integrate its services into their applications, enabling their customers to access their invoices on the go, directly from the applications. With this API, clients and customers can have access to, and to make changes to their invoices.", 
    "api_url_full": "https://facturagem.com/en/developers/api_docs", 
    "progweb_date": "12.30.2014", 
    "correct_link": 1,
    "api_name": "FACTURAgem", 
    "error": 0, 
    "progweb_cat": "Invoicing,Business", 
    "id": 6047, 
    "api_url": "facturagem.com"
  }, 
  {
    "crawled_date": "2017-06-27T16:10:28.111709", 
    "progweb_title": "Scio API", 
    "progweb_url": "https://www.programmableweb.com/api/scio", 
    "progweb_descr": "Scio is a molecular sensor device that can read the chemical make up of materials and objects. With the Scio application, the chemical make up of whatever the user scans with Scio is retrieved. The Scio API allows developers to access and integrate the functionality and data of Scio with other applications and to create new applications. Public documentation is not available; interested developers should email feedback@consumerphysics.com for more information.", 
    "api_url_full": "https://www.consumerphysics.com/myscio/developers", 
    "progweb_date": "01.06.2015", 
    "correct_link": 0,
    "api_name": "Scio", 
    "error": 0, 
    "progweb_cat": "Internet of Things,Health", 
    "id": 6066, 
    "api_url": "consumerphysics.com"
  }, 
  {
    "api_url": "github.com", 
    "progweb_title": "Ron Swanson Quotes API", 
    "progweb_url": "https://www.programmableweb.com/api/ron-swanson-quotes", 
    "progweb_descr": "Ron Swanson is a fictional character portrayed by actor Nick Offerman. The Ron Swanson Quotes API was developed by James Wright, an independent web developer. This API lets other developers integrate its database with their applications, enabling their users to have access to the Ron Swanson quotes directly.", 
    "api_url_full": "https://github.com/jamesseanwright/ron-swanson-quotes", 
    "progweb_date": "01.15.2015", 
    "correct_link": 0,
    "api_name": "Ron Swanson Quotes", 
    "error": 0, 
    "progweb_cat": "TV,Celebrities", 
    "id": 6146, 
    "crawled_date": "2017-06-27T16:10:18.427288"
  }, 
  {
    "crawled_date": "2017-06-27T16:28:00.649751", 
    "progweb_title": "Yes or No API", 
    "progweb_url": "https://www.programmableweb.com/api/yes-or-no", 
    "progweb_descr": "The simple Yes or No API is made for automating boolean decision making within mobile environments. API calls will return a \"Yes\", \"No\" or \"Maybe.\" Returns include fun links to comical Gifs, such as Hugh Laurie or Client Eastwood nodding in approval, or Jim from the Office excitedly mouthing \"Yes!\", or an uncomfortably slow camera zoom on Zach Galifianakis.", 
    "api_url_full": "http://ow.ly/FWNUW", 
    "progweb_date": "12.15.2014", 
    "correct_link": 0,
    "api_name": "Yes or No", 
    "error": 0, 
    "progweb_cat": "Application Development,Entertainment", 
    "id": 6468, 
    "api_url": "ow.ly"
  }, 
  {
    "crawled_date": "2017-06-27T16:45:28.349647", 
    "progweb_title": "eBay Listing Recommendation API", 
    "progweb_url": "https://www.programmableweb.com/api/ebay-listing-recommendation", 
    "progweb_descr": "eBay Listing Recommendation API allows developers to integrate different types of listing types into their data. Some of the listing types are category, condition descriptions, shipping eligibility, picture,..", 
    "api_url_full": "https://go.developer.ebay.com/developers/ebay/documentation-tools#listingrecommendation", 
    "progweb_date": "10.06.2014", 
    "correct_link": 0,
    "api_name": "eBay Listing Recommendation", 
    "error": 0, 
    "progweb_cat": "Lists,Auctions", 
    "id": 6692, 
    "api_url": "ebay.com"
  }, 
  {
    "crawled_date": "2017-06-27T17:02:15.117955", 
    "progweb_title": "EDGAR Online API", 
    "progweb_url": "https://www.programmableweb.com/api/edgar-online", 
    "progweb_descr": "EDGAR Online is a service that provides data related to equities, mutual funds and public assets. With the API, developers could retrieve financial information from an individual, search financial content of a company and even complete targeted searches in multiple locations. The API is about financial data and it may be useful for developers in the financial sector who intent to have access to financial public information. To create an application, developers can register for an API key. At the same time, they can review the datasets along with actions and description for different parameters such as companies, coreFinancials and CompanySets. Just as the API Key is required, also is the protocol HTTPS, endpoints and responses in JSON/XML formats.", 
    "api_url_full": "http://developer.edgar-online.com/docs", 
    "progweb_date": "08.13.2014", 
    "correct_link": 1,
    "api_name": "EDGAR Online", 
    "error": 0, 
    "progweb_cat": "Financial,Data", 
    "id": 6890, 
    "api_url": "edgar-online.com"
  }, 
  {
    "crawled_date": "2017-06-27T17:01:59.941676", 
    "progweb_title": "getNewsCatagories API", 
    "progweb_url": "https://www.programmableweb.com/api/getnewscatagories", 
    "progweb_descr": "Barchart OnDemand provides data pertaining to the agriculture, media, financial, and energy industries. The getNewsCategories API provides access to news source category and sub-category data. All Barchart OnDemand APIs allow for queries in JSON, XML, and CSV formats. Developers can visit BarChart's site to request permission for API usage.", 
    "api_url_full": "http://www.barchartondemand.com/api/getNewsCategories", 
    "progweb_date": "08.26.2014", 
    "correct_link": 0,
    "api_name": "getNewsCatagories", 
    "error": 0, 
    "progweb_cat": "News Services,Metadata", 
    "id": 7004, 
    "api_url": "barchartondemand.com"
  }, 
  {
    "crawled_date": "2017-06-27T17:01:53.318949", 
    "progweb_title": "Above.com  API", 
    "progweb_url": "https://www.programmableweb.com/api/abovecom", 
    "progweb_descr": "Above.com is a Trellian company that allows users to monetize transactions, either by selling or buying web domains. The main value of this API is the possibility to integrate platforms with domain investment purposes. This API supports XML format and requires an API Key. In the website, developers can see resources such as API queries, authentication, secure connection, error codes, usage limits, and code examples.", 
    "api_url_full": "http://domains.above.com/api-manual.html", 
    "progweb_date": "09.11.2014", 
    "correct_link": 0,
    "api_name": "Above.com", 
    "error": 0, 
    "progweb_cat": "Domains,Monetization", 
    "id": 7045, 
    "api_url": "above.com"
  }, 
  {
    "crawled_date": "2017-06-27T17:19:47.730365", 
    "progweb_title": "SWTOR Fan Managed API", 
    "progweb_url": "https://www.programmableweb.com/api/swtor-fan-managed", 
    "progweb_descr": "A collection of Fan Managed APIs are available to help developers access data from STAR WARS: The Old Republic (SWTOR). Currently, people can use the APIs to get information on game events, including Bounty Contract Week, Relics of the Gree, Rakghoul Outbreak, Double XP, and Lifeday. Future APIs will allow users to retrieve Leaderboard Data and the Server Status.", 
    "api_url_full": "http://www.swtor.com/community/showthread.php?s=81944b091aa9679fa677a0d706324af1&p=7456215#post7456215", 
    "progweb_date": "06.01.2014", 
    "correct_link": 0,
    "api_name": "SWTOR Fan Managed", 
    "error": 0, 
    "progweb_cat": "Games", 
    "id": 7129, 
    "api_url": "swtor.com"
  }, 
  {
    "crawled_date": "2017-06-27T17:19:31.532090", 
    "progweb_title": "DIY API", 
    "progweb_url": "https://www.programmableweb.com/api/diy", 
    "progweb_descr": "DIY is a  social network for DIY projects aimed at children and students.  DIY's API is focused on managing the application content by allowing users to create, update, add, delete and search for projects, people, categories, and users.", 
    "api_url_full": "http://docs.diy.org/", 
    "progweb_date": "07.02.2014", 
    "correct_link": 1,
    "api_name": "DIY", 
    "error": 0, 
    "progweb_cat": "Education,Project Management", 
    "id": 7212, 
    "api_url": "diy.org"
  }, 
  {
    "crawled_date": "2017-06-27T17:35:31.712019", 
    "progweb_title": "World DanceSport Federation API", 
    "progweb_url": "https://www.programmableweb.com/api/world-dancesport-federation", 
    "progweb_descr": "As the international governing organization for DanceSport, the World DanceSport Federation provides regulations, standards, and advice for competitions in Latin, Standard, Acrobatic, Line, New Vogue, Salsa, Wheelchair, and other types of dance.  The WDSF API allows third party applications created by authorized competition scrutineers to transmit and share competition results and scores with the WDSF in a standardized format.", 
    "api_url_full": "https://services.worlddancesport.org/api/1", 
    "progweb_date": "03.18.2014", 
    "correct_link": 1,
    "api_name": "World DanceSport Federation", 
    "error": 0, 
    "progweb_cat": "Sports,Reporting", 
    "id": 7376, 
    "api_url": "worlddancesport.org"
  }, 
  {
    "crawled_date": "2017-06-27T18:10:24.817057", 
    "progweb_title": "Domeny.tv API", 
    "progweb_url": "https://www.programmableweb.com/api/domenytv", 
    "progweb_descr": "Domeny.tv is a Polish website registration and management service that manages thousands of sites for polish speaking customers and customers across the world. The Domeny.tv API offers a full range of features including registrations, renewals, management, and others. An account is required with service, and a full testing environment is available for use before going live with third-party applications and interfaces.", 
    "api_url_full": "http://www.domeny.tv/en/registrar-api", 
    "progweb_date": "12.23.2013", 
    "correct_link": 0,
    "api_name": "Domeny.tv", 
    "error": 0, 
    "progweb_cat": "Backend,Domains", 
    "id": 7960, 
    "api_url": "domeny.tv"
  }, 
  {
    "crawled_date": "2017-06-27T18:10:20.383158", 
    "progweb_title": "National Terrorism Advisory System API", 
    "progweb_url": "https://www.programmableweb.com/api/national-terrorism-advisory-system", 
    "progweb_descr": "The National Terrorism Advisory System (NTAS) is a service of the Department of Homeland Security designed to effectively communicate information about terrorist threats. The NTAS is exposed as a simple API able to deliver alerts as discreet XML files or as an XML feed. Alerts contain structured data fields such as summary and details, location or region, duration, â€œhow to helpâ€\u009d, and much more.", 
    "api_url_full": "http://www.dhs.gov/ntas-api-documentation", 
    "progweb_date": "12.28.2013", 
    "correct_link": 1,
    "api_name": "National Terrorism Advisory System", 
    "error": 0, 
    "progweb_cat": "Government", 
    "id": 7984, 
    "api_url": "dhs.gov"
  }, 
  {
    "crawled_date": "2017-06-27T19:20:05.639571", 
    "progweb_title": "UK Biodiversity Action Reporting System API", 
    "progweb_url": "https://www.programmableweb.com/api/uk-biodiversity-action-reporting-system", 
    "progweb_descr": "The UK Biodiversity Action Reporting System (BARS) supports the conservation community by providing a place for people to post and search for information on work being done to benefit important habitats and species. This information includes the level of activity, where it is taking place, and the project's goals. BARS also maps action locations and produces statistical summaries of the data. The goals of the system are to help committees coordinate their actions and to help government agencies report on biodiversity loss prevention work for their various commitments and treaties. Developer can access and display BARS data using SOAP calls issued in XML format.", 
    "api_url_full": "http://ukbars.defra.gov.uk/archive/news/webservices.asp", 
    "progweb_date": "06.26.2013", 
    "correct_link": 0,
    "api_name": "UK Biodiversity Action Reporting System", 
    "error": 0, 
    "progweb_cat": "Science,Mapping", 
    "id": 9036, 
    "api_url": "defra.gov.uk"
  }, 
  {
    "crawled_date": "2017-06-27T19:54:16.277240", 
    "progweb_title": "Rebtel Voice Platform API", 
    "progweb_url": "https://www.programmableweb.com/api/rebtel-voice-platform", 
    "progweb_descr": "Rebtel Voice Platform is an international calling platform. Users can use Rebtel from their mobile phones to make international calls at various rates.   The Rebtel Voice Platform API and SDK allow developers to access and integrate the functionality of Rebtel with other applications. Some example API methods include making calls, managing calls, and checking call rates.", 
    "api_url_full": "http://developer.rebtel.com", 
    "progweb_date": "04.26.2013", 
    "correct_link": 0,
    "api_name": "Rebtel Voice Platform", 
    "error": 0, 
    "progweb_cat": "Telephony,Mobile", 
    "id": 9795, 
    "api_url": "rebtel.com"
  }, 
  {
    "crawled_date": "2017-06-27T20:11:56.626488", 
    "progweb_title": "BGC Market Data API", 
    "progweb_url": "https://www.programmableweb.com/api/bgc-market-data", 
    "progweb_descr": "BGC Market Data is a supplier of international financial data. Finance professionals use BGC products and services for price discovery, analysis, risk management, portfolio monitoring and valuation, research, and more.  BGCantor On-Demand is a service offered by BGC Market Data for accessing treasury, fixed income, foreign exchange, futures, and credit derivatives data. This data is available for integration with users' applications and services using SOAP-based APIs.", 
    "api_url_full": "http://www.bgcantorondemand.com/Default.aspx", 
    "progweb_date": "02.25.2013", 
    "correct_link": 0,
    "api_name": "BGC Market Data", 
    "error": 0, 
    "progweb_cat": "Financial", 
    "id": 10023, 
    "api_url": "bgcantorondemand.com"
  }, 
  {
    "crawled_date": "2017-06-27T20:45:40.556095", 
    "progweb_title": "Hawkesbury City Council Masterview API", 
    "progweb_url": "https://www.programmableweb.com/api/hawkesbury-city-council-masterview", 
    "progweb_descr": "Masterview is Hawkesbury City Council's application tracking system. It enables users to track the status of Development Applications, Construction Certificates, and Complying Development Certificates. Users can search for an application for a particular property by application number or by property address. Users can also search for details on all developments within a particular time frame. Masterview can be accessed directly through the website or programmatically via SOAP API.", 
    "api_url_full": "http://council.hawkesbury.nsw.gov.au/MasterViewUI/Modules/Applicationmaster/Default.aspx?page=disc", 
    "progweb_date": "12.17.2012", 
    "correct_link": 0,
    "api_name": "Hawkesbury City Council Masterview", 
    "error": 0, 
    "progweb_cat": "Government,Australian", 
    "id": 10625, 
    "api_url": "nsw.gov.au"
  }, 
  {
    "crawled_date": "2017-06-27T21:03:40.688551", 
    "progweb_title": "GroveStreams API", 
    "progweb_url": "https://www.programmableweb.com/api/grovestreams", 
    "progweb_descr": "GroveStreams is an Internet of Things cloud platform providing near real-time complex decision making capabilities to millions of users and devices. Most of GroveStreams' capabilities are exposed through a REST API including the ability to model devices, feed data into and out of GroveStreams organizations, setup events and notifications and create dashboards.", 
    "api_url_full": "https://www.grovestreams.com/developers/developers.html", 
    "progweb_date": "10.17.2012", 
    "correct_link": 0,
    "api_name": "GroveStreams", 
    "error": 0, 
    "progweb_cat": "Enterprise,Analytics", 
    "id": 10686, 
    "api_url": "grovestreams.com"
  }, 
  {
    "crawled_date": "2017-06-27T21:20:46.394709", 
    "progweb_title": "Mollie Payment API", 
    "progweb_url": "https://www.programmableweb.com/api/mollie-payment", 
    "progweb_descr": "Mollie is a Netherlands based SMS provider of both SMS and payments services. Through Mollie, customers can use iDEAL, the most widely used online payment method in the Netherlands. Other payment services include the use of the paysafecard, the most widely used prepaid card for online payments, pay per call, pay per minute, and pay per SMS.  The Payments APIs are a suite of APIs that give developers access to the payment functionalities of Mollie. These include iDEAL payments, integrating paysafecard functionality into a website, phone based micropayments and more. The APIs uses RESTful calls and responses are formatted in XML. The site and documentation are in Dutch.", 
    "api_url_full": "https://www.mollie.nl/support/documentatie/betaaldiensten/", 
    "progweb_date": "10.08.2012", 
    "correct_link": 0,
    "api_name": "Mollie Payment", 
    "error": 0, 
    "progweb_cat": "Payments", 
    "id": 11122, 
    "api_url": "mollie.nl"
  }, 
  {
    "crawled_date": "2017-06-27T21:20:39.839674", 
    "progweb_title": "Google Time Zone API", 
    "progweb_url": "https://www.programmableweb.com/api/google-time-zone", 
    "progweb_descr": "Google Time Zone provides time zone information for locations around the world, by latitude and longitude.   The Google Time Zone API allows developers to access and integrate the data and functionality of Google Time Zone with other applications and to create new applications. The main API method is returning time zone data for locations.", 
    "api_url_full": "https://developers.google.com/maps/documentation/timezone/", 
    "progweb_date": "10.12.2012", 
    "correct_link": 1,
    "api_name": "Google Time Zone", 
    "error": 0, 
    "progweb_cat": "Tools,Mapping", 
    "id": 11177, 
    "api_url": "google.com"
  }, 
  {
    "crawled_date": "2017-06-27T21:38:42.286635", 
    "progweb_title": "4GuysFromRolla.com API", 
    "progweb_url": "https://www.programmableweb.com/api/4guysfromrollacom", 
    "progweb_descr": "ASPFAQs is a publicly available reference service provided by 4GuysFromRolla.com to assist developers working with ASP.NET. The FAQ pages are available on the website, or they can be accessed programmatically using SOAP calls. Function exist for retrieving FAQs, retrieving FAQ categories, or retrieving FAQs by category.", 
    "api_url_full": "http://aspnet.4guysfromrolla.com/ws/ASPFAQs.asmx", 
    "progweb_date": "08.31.2012", 
    "correct_link": 0,
    "api_name": "4GuysFromRolla.com", 
    "error": 0, 
    "progweb_cat": "Q&A,Reference", 
    "id": 11320, 
    "api_url": "4guysfromrolla.com"
  }, 
  {
    "crawled_date": "2017-06-27T21:55:39.980959", 
    "progweb_title": "Meteomedia Weather Development Kit API", 
    "progweb_url": "https://www.programmableweb.com/api/meteomedia-weather-development-kit", 
    "progweb_descr": "Mminternational is a weather measurement network from MeteoGroup, a German weather services company. Meteomedia is a division of mminternational providing weather products and services for the media and public. The meteomedia Weather Development Kit is an API providing programmatic access to data from the mminternational database. Accessible services include worldwide weather data, measurements and forecasts, and more.", 
    "api_url_full": "http://www.mminternational.com/web/en/weather-development-kit", 
    "progweb_date": "08.09.2012", 
    "correct_link": 0,
    "api_name": "Meteomedia Weather Development Kit", 
    "error": 0, 
    "progweb_cat": "Weather,Measurements", 
    "id": 11644, 
    "api_url": "mminternational.com"
  }, 
  {
    "crawled_date": "2017-06-27T22:13:40.137078", 
    "progweb_title": "Grapevine SMS API", 
    "progweb_url": "https://www.programmableweb.com/api/grapevine-sms", 
    "progweb_descr": "The service provides SMS text messaging for recipients in South Africa. It is designed to integrate with line-of-business systems such as  CRM and ERP to update customers about system events, such as payment due dates, past-due balances, confirmation of payments received, and planned system outages. The service also handles message replies and other inbound SMS communications.  API methods support submission of message type, recipient, and content. Methods also handle response messages, including response codes and reasons for proper routing.", 
    "api_url_full": "http://www.grapevinemessaging.co.za/", 
    "progweb_date": "06.22.2012", 
    "correct_link": 0,
    "api_name": "Grapevine SMS", 
    "error": 0, 
    "progweb_cat": "Messaging,African", 
    "id": 11757, 
    "api_url": "grapevinemessaging.co.za"
  }, 
  {
    "crawled_date": "2017-06-27T22:29:09.763989", 
    "progweb_title": "Applicasa API", 
    "progweb_url": "https://www.programmableweb.com/api/applicasa", 
    "progweb_descr": "Applicasa is a server side solution that lets developers build backends for their mobile apps. Applicasas offers a drag and drop interface for database creation allowing a backend to be built in minutes. The Applicasa API contains CRUD functions, filters, paging, sorting and queries such as push notification, scheduling and API calling options. Responses are formatted in JSON.", 
    "api_url_full": "http://www.applicasa.com/", 
    "progweb_date": "06.15.2012", 
    "correct_link": 0,
    "api_name": "Applicasa", 
    "error": 0, 
    "progweb_cat": "Backend,Mobile", 
    "id": 12207, 
    "api_url": "applicasa.com"
  }, 
  {
    "crawled_date": "2017-06-27T22:46:47.146221", 
    "progweb_title": "MasterCard PayPass Online API", 
    "progweb_url": "https://www.programmableweb.com/api/mastercard-paypass-online", 
    "progweb_descr": "PayPass Online allows checkout from a site or app using any wallet that belongs to the Paypass Online network. This speeds up the checkout process by allowing customers to use the payment and shipping information already associated with their wallet of choice on the network. PayPass Online supports full and mobile sites and both Android and iOS apps. This service is free for both consumers and merchants.", 
    "api_url_full": "https://developer.mastercard.com/portal/display/api/MasterPass+-+Merchant+Checkout", 
    "progweb_date": "05.09.2012", 
    "correct_link": 0,
    "api_name": "MasterCard PayPass Online", 
    "error": 0, 
    "progweb_cat": "Payments,Credit Cards", 
    "id": 12449, 
    "api_url": "mastercard.com"
  }, 
  {
    "crawled_date": "2017-06-27T23:21:56.363150", 
    "progweb_title": "Pulsepoint API", 
    "progweb_url": "https://www.programmableweb.com/api/pulsepoint", 
    "progweb_descr": "The service creates a registry of people trained in cardiopulmonary resuscitation (CPR) who are willing to assist victims of Sudden Cardiac Arrest (SCA) near their locations. Members of the registry create entries indicating their willingness to respond and provide contact information. The service accepts notification from a participating agency of a cardiac emergency and contacts registry members near the location.  API methods support creation and tracking of incidents, including notifying agency, time, location, and type of incident. Methods also support designation of medical status of the victim and call status from the responding agency.", 
    "api_url_full": "http://developer.pulsepoint.org/doc.php", 
    "progweb_date": "02.19.2012", 
    "correct_link": 0,
    "api_name": "Pulsepoint", 
    "error": 0, 
    "progweb_cat": "Medical,Social", 
    "id": 12824, 
    "api_url": "pulsepoint.org"
  }, 
  {
    "crawled_date": "2017-06-27T23:21:56.334553", 
    "progweb_title": "Geo3DModelService API", 
    "progweb_url": "https://www.programmableweb.com/api/geo3dmodelservice", 
    "progweb_descr": "The Geo3DModelService API, available via SOAP or REST protocols, is a program for generating cross-sectional models of subterranean conditions using geologic data. Users can create models of vertical or horizontal cross-sections with an accompanying key to make the generated map's meaning explicit.  All documentation is in Dutch.", 
    "api_url_full": "http://www.dinoservices.nl/geo3dmodelwebservices-1/", 
    "progweb_date": "02.20.2012", 
    "correct_link": 0,
    "api_name": "Geo3DModelService", 
    "error": 0, 
    "progweb_cat": "Science,Geology", 
    "id": 12935, 
    "api_url": "dinoservices.nl"
  }, 
  {
    "crawled_date": "2017-06-27T23:39:19.431689", 
    "progweb_title": "qrd.by API", 
    "progweb_url": "https://www.programmableweb.com/api/qrdby", 
    "progweb_descr": "Qrd.by is a service that generates QR Codes of any URL and helps users track when, where and from which device they have been scanned. The qrd.by API lets users shorten URLs and retrieve statistics for each of their shortened URLs. Registered users can use the API to add additional geo information like Longitude und Latitude to the QR Code. The API uses RESTful calls and responses are formatted in JSON.", 
    "api_url_full": "http://qrd.by/qr-code-api", 
    "progweb_date": "01.16.2012", 
    "correct_link": 1,
    "api_name": "qrd.by", 
    "error": 0, 
    "progweb_cat": "Tools,QR Codes", 
    "id": 13201, 
    "api_url": "qrd.by"
  }, 
  {
    "crawled_date": "2017-06-27T23:39:12.364228", 
    "progweb_title": "OneDesk API", 
    "progweb_url": "https://www.programmableweb.com/api/onedesk", 
    "progweb_descr": "OneDesk's RESTful API provides programmatic access to the OneDesk application. APIs support integrating 3rd party tools with OneDesk's help desk, project management, and product management software applications. OneDesk is a cloud based platform that offers tools to assist with product development and management. It is meant to help with the coordination of team members including product managers, engineers, marketing and customer support. The API lets developers access the functionality of the platform programatically. Some of the functionality includes accessing organizations and their information, working with feedback, posts, projects and more. The API uses RESTful calls and resposnes are formatted in XML and JSON. )", 
    "api_url_full": "http://onedesk.com/developers/",
    "progweb_date": "01.25.2012", 
    "correct_link": 0,
    "api_name": "OneDesk", 
    "error": 0, 
    "progweb_cat": "Project Management,Application Development", 
    "id": 13260, 
    "api_url": "onedesk.com"
  }, 
  {
    "crawled_date": "2017-06-28T00:13:57.329907", 
    "progweb_title": "ConvertAPI Web2Image API", 
    "progweb_url": "https://www.programmableweb.com/api/convertapi-web2image", 
    "progweb_descr": "Web2Image lets developers create a screen capture image from any URL. The ConvertAPI Web2Image API is a pay-per-credit API that allows website URLs to be converted into various image formats. Available image formats are BMP, TIFF, JPG, and PNG. Pricing begins at $15 for 1,000 calls.", 
    "api_url_full": "http://www.convertapi.com/web-image-api", 
    "progweb_date": "09.30.2011", 
    "correct_link": 2, 
    "api_name": "ConvertAPI Web2Image", 
    "error": 0, 
    "progweb_cat": "Tools,Images", 
    "id": 13676, 
    "api_url": "convertapi.com"
  }, 
  {
    "crawled_date": "2017-06-28T00:32:12.239874", 
    "progweb_title": "SeedFinder API", 
    "progweb_url": "https://www.programmableweb.com/api/seedfinder", 
    "progweb_descr": "SeedFinder provides a standardized online collection of information on cannabis varieties. They provide grow advice, strain reviews, and connect growers and enthusiasts with with each other and information in a searchable way. The SeedFinder API allows access to the data through HTTP Get and POST requests as well as a client development of the content and infrastructure within SeedFinder to create applications.", 
    "api_url_full": "http://en.seedfinder.eu/api/", 
    "progweb_date": "08.04.2011", 
    "correct_link": 0,
    "api_name": "SeedFinder", 
    "error": 0, 
    "progweb_cat": "Reference,Drugs", 
    "id": 13961, 
    "api_url": "seedfinder.eu"
  }, 
  {
    "crawled_date": "2017-06-28T01:05:48.950009", 
    "progweb_title": "AT&T Location API", 
    "progweb_url": "https://www.programmableweb.com/api/att-location", 
    "progweb_descr": "The Location API not only returns longitude and latitude coordinates, but also supports A-GPS, thereby speeding up the time it takes to pinpoint a device's location.  Knowing the location of your customer can be crucial to the service you provide. Whether you want to simplify social interactions, support location-based advertising and search, give directions, or enhance any number of other activities, the AT&T Location API makes it simple to know where your customers are.", 
    "api_url_full": "http://developer.att.com/developer/forward.jsp?passedItemId=2400388", 
    "progweb_date": "02.08.2011", 
    "correct_link": 0,
    "api_name": "AT&T Location", 
    "error": 0, 
    "progweb_cat": "Telephony,Mapping", 
    "id": 14518, 
    "api_url": "att.com"
  }, 
  {
    "crawled_date": "2017-06-28T01:58:16.886956", 
    "progweb_title": "Snipt API", 
    "progweb_url": "https://www.programmableweb.com/api/snipt", 
    "progweb_descr": "Snipt is a tool for developers and non developers alike. It allows you to post long pieces of text or code (Snipts) and share them with people using convenient short URLs.", 
    "api_url_full": "http://code.google.com/p/snipt-org/wiki/REST_API_Docs?tm=6", 
    "progweb_date": "03.30.2009", 
    "correct_link": 0,
    "api_name": "Snipt", 
    "error": 0, 
    "progweb_cat": "Tools,Application Development", 
    "id": 15319, 
    "api_url": "google.com"
  }, 
  {
    "crawled_date": "2017-06-28T02:15:14.590052", 
    "progweb_title": "Tell Them What You Think API", 
    "progweb_url": "https://www.programmableweb.com/api/tell-them-what-you-think", 
    "progweb_descr": "Search all current UK government consultations for words and phrases. Set up alerts via email or RSS to tell you when consultations of interest are published. Government consultations are documents published by the government which ask for people or groups to tell them what they think about a particular topic.", 
    "api_url_full": "http://tellthemwhatyouthink.org/api/", 
    "progweb_date": "07.03.2008", 
    "correct_link": 1,
    "api_name": "Tell Them What You Think", 
    "error": 0, 
    "progweb_cat": "Government,England", 
    "id": 15661, 
    "api_url": "tellthemwhatyouthink.org"
  }, 
  {
    "crawled_date": "2017-06-28T02:15:05.730626", 
    "progweb_title": "Feedbooks API", 
    "progweb_url": "https://www.programmableweb.com/api/feedbooks", 
    "progweb_descr": "Use the Feedbooks API to search the Feedbooks database of books, authors, and lists available for download to your mobile device. Feedbooks is a site used to download free e-books, and it is compatible with all mobile devices. You can also publish your own content or read content that you customize from RSS feeds. Use the API to access cover images in PNG format, as well as content matching your search query in PDF, Mobi, XHTML, and ePub format.", 
    "api_url_full": "http://www.feedbooks.com/api", 
    "progweb_date": "09.14.2008", 
    "correct_link": 1,
    "api_name": "Feedbooks", 
    "error": 0, 
    "progweb_cat": "Telephony,Books", 
    "id": 15711, 
    "api_url": "feedbooks.com"
  }, 
  {
    "crawled_date": "2017-06-28T02:15:01.347900", 
    "progweb_title": "VideoBloom API", 
    "progweb_url": "https://www.programmableweb.com/api/videobloom", 
    "progweb_descr": "The VideoBloom \"Integrator\" Application Programming Interface (API) allows your company to empower all members of your marketplace with online video capabilities.  Members can easily add and remove videos to their Web sites, listings, classifieds or properties as well as manage their video playlists.  Your company, the ï¿½Integratorï¿½, maintains high-level member management rights, such as adding/removing members, shared credentials between Web properties, total video usage statistics, etc.  Since the Integrator API is a private label API, your company will display video using its own look-and-feel.  VideoBloom's Integrator API is perfect for real estate portals, automotive marketplaces, retailers, classifieds, directories, universities, professional associations, social networks, etc.  Key functionalities of the Integrator API include:  - Marketplace members can add and remove videos, edit video descriptions; - Marketplace members can track video usage in real-time for each individual video; - Integrator can add and remove video capability for specific members; - Integrator can manage shared credentials (passwords, etc.) for seamless video usage; - Integrator can monitor video marketplace statistics in real-time; - Integrator can select type of online video players to be integrated in the marketplace; - Integrator can use own look-and-feel to display video in marketplace.  Power marketplaces, directories, social networks, and e-commerce Web sites with video.  Deployment:  Average installation time is 30 hours. (Deployment time is based on an average client installation, performed by client.)", 
    "api_url_full": "http://www.videobloom.com/partner-program/", 
    "progweb_date": "10.18.2008", 
    "correct_link": 0,
    "api_name": "VideoBloom", 
    "error": 0, 
    "progweb_cat": "Video,Publishing", 
    "id": 15742, 
    "api_url": "videobloom.com"
  }
]
